#include <iostream>
#include <cmath>
using namespace std;

int main() {
    double a, b, c;
    cout << "Введіть три дійсних числа: ";
    cin >> a >> b >> c;

    double a0 = a, b0 = b, c0 = c;
    cout << "Початкові значення: a = " << a0 << ", b = " << b0 << ", c = " << c0 << endl;

    if (a0 == b0 || a0 == c0) {
        a = a0 * a0;
        cout << "a дорівнює іншому числу, тому замінено його квадратом." << endl;
    } else {
        a = sin(a0);
        cout << "a не дорівнює іншим, тому замінено його синусом." << endl;
    }

    if (b0 == a0 || b0 == c0) {
        b = b0 * b0;
        cout << "b дорівнює іншому числу, тому замінено його квадратом." << endl;
    } else {
        b = sin(b0);
        cout << "b не дорівнює іншим, тому замінено його синусом." << endl;
    }

    if (c0 == a0 || c0 == b0) {
        c = c0 * c0;
        cout << "c дорівнює іншому числу, тому замінено його квадратом." << endl;
    } else {
        c = sin(c0);
        cout << "c не дорівнює іншим, тому замінено його синусом." << endl;
    }

    cout << "Кінцеві значення: a = " << a << ", b = " << b << ", c = " << c << endl;

    return 0;
}